TexasInstruments/c2000ware-core-sdk/device_support/f28p551x/headers/source/f28p551x_globalvariabledefs.c
//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC2RegsFile")
#else
#pragma DATA_SECTION(EradCRC2Regs,"EradCRC2RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC3RegsFile")
#else
#pragma DATA_SECTION(EradCRC3Regs,"EradCRC3RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC4RegsFile")
#else
#pragma DATA_SECTION(EradCRC4Regs,"EradCRC4RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC5RegsFile")
#else
#pragma DATA_SECTION(EradCRC5Regs,"EradCRC5RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC6RegsFile")
#else
#pragma DATA_SECTION(EradCRC6Regs,"EradCRC6RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC6Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC7RegsFile")
#else
#pragma DATA_SECTION(EradCRC7Regs,"EradCRC7RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC7Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradCRC8RegsFile")
#else
#pragma DATA_SECTION(EradCRC8Regs,"EradCRC8RegsFile");
#endif
volatile struct ERAD_CRC_REGS EradCRC8Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradGlobalRegsFile")
#else
#pragma DATA_SECTION(EradGlobalRegs,"EradGlobalRegsFile");
#endif
volatile struct ERAD_GLOBAL_REGS EradGlobalRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp1RegsFile")
#else
#pragma DATA_SECTION(EradHWbp1Regs,"EradHWbp1RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp1Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp2RegsFile")
#else
#pragma DATA_SECTION(EradHWbp2Regs,"EradHWbp2RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp2Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp3RegsFile")
#else
#pragma DATA_SECTION(EradHWbp3Regs,"EradHWbp3RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp3Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp4RegsFile")
#else
#pragma DATA_SECTION(EradHWbp4Regs,"EradHWbp4RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp4Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp5RegsFile")
#else
#pragma DATA_SECTION(EradHWbp5Regs,"EradHWbp5RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp5Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp6RegsFile")
#else
#pragma DATA_SECTION(EradHWbp6Regs,"EradHWbp6RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp6Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp7RegsFile")
#else
#pragma DATA_SECTION(EradHWbp7Regs,"EradHWbp7RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp7Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("EradHWbp8RegsFile")
#else
#pragma DATA_SECTION(EradHWbp8Regs,"EradHWbp8RegsFile");
#endif
volatile struct ERAD_HWBP_REGS EradHWbp8Regs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Flash0CtrlRegsFile")
#else
#pragma DATA_SECTION(Flash0CtrlRegs,"Flash0CtrlRegsFile");
#endif
volatile struct FLASH_CTRL_REGS Flash0CtrlRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("Flash0EccRegsFile")
#else
#pragma DATA_SECTION(Flash0EccRegs,"Flash0EccRegsFile");
#endif
volatile struct FLASH_ECC_REGS Flash0EccRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("FsiRxaRegsFile")
#else
#pragma DATA_SECTION(FsiRxaRegs,"FsiRxaRegsFile");
#endif
volatile struct FSI_RX_REGS FsiRxaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("FsiTxaRegsFile")
#else
#pragma DATA_SECTION(FsiTxaRegs,"FsiTxaRegsFile");
#endif
volatile struct FSI_TX_REGS FsiTxaRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("GpioCtrlRegsFile")
#else
#pragma DATA_SECTION(GpioCtrlRegs,"GpioCtrlRegsFile");
#endif
volatile struct GPIO_CTRL_REGS GpioCtrlRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("GpioDataReadRegsFile")
#else
#pragma DATA_SECTION(GpioDataReadRegs,"GpioDataReadRegsFile");
#endif
volatile struct GPIO_DATA_READ_REGS GpioDataReadRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("GpioDataRegsFile")
#else
#pragma DATA_SECTION(GpioDataRegs,"GpioDataRegsFile");
#endif
volatile struct GPIO_DATA_REGS GpioDataRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("I2caRegsFile")
#else
#pragma DATA_SECTION(I2caRegs,"I2caRegsFile");
#endif
volatile struct I2C_REGS I2caRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("I2cbRegsFile")
#else
#pragma DATA_SECTION(I2cbRegs,"I2cbRegsFile");
#endif
volatile struct I2C_REGS I2cbRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("InputXbarRegsFile")
#else
#pragma DATA_SECTION(InputXbarRegs,"InputXbarRegsFile");
#endif
volatile struct INPUT_XBAR_REGS InputXbarRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("ClbInputXbarRegsFile")
#else
#pragma DATA_SECTION(ClbInputXbarRegs,"ClbInputXbarRegsFile");
#endif
volatile struct INPUT_XBAR_REGS ClbInputXbarRegs;

//----------------------------------------
#ifdef __cplusplus
#pragma DATA_SECTION("LfuRegsFile")
#else
#pragma DATA_SECTION(LfuRegs,"LfuRegsFile");
#endif
volatile struct LFU_REGS LfuRegs;

